In [1]:
from pandas import read_csv

In [2]:
filename = 'daily_retail_price_Onion-upto_apr_2015.csv'
header_names = ['Date','Centre_Name','Commodity_Name','Price']
data = read_csv(filename,names = header_names)

In [3]:
data

            Date      Centre_Name Commodity_Name  Price
0       25-11-97            DELHI          Onion    8.0
1       25-11-97           SHIMLA          Onion    7.0
2       25-11-97          LUCKNOW          Onion    5.0
3       25-11-97        AHMEDABAD          Onion    6.0
4       25-11-97           BHOPAL          Onion    8.0
...          ...              ...            ...    ...
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]

In [4]:
print(data.dtypes)

Date               object
Centre_Name        object
Commodity_Name     object
Price             float64
dtype: object

In [5]:
data.ndim

2

In [6]:
data.shape

(127911, 4)

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 127911 entries, 0 to 127910
Data columns (total 4 columns):
Date              127911 non-null object
Centre_Name       127911 non-null object
Commodity_Name    127911 non-null object
Price             115991 non-null float64
dtypes: float64(1), object(3)
memory usage: 3.9+ MB

In [8]:
data.head()

       Date Centre_Name Commodity_Name  Price
0  25-11-97       DELHI          Onion    8.0
1  25-11-97      SHIMLA          Onion    7.0
2  25-11-97     LUCKNOW          Onion    5.0
3  25-11-97   AHMEDABAD          Onion    6.0
4  25-11-97      BHOPAL          Onion    8.0

In [9]:
data.head(10)

       Date   Centre_Name Commodity_Name  Price
0  25-11-97         DELHI          Onion    8.0
1  25-11-97        SHIMLA          Onion    7.0
2  25-11-97       LUCKNOW          Onion    5.0
3  25-11-97     AHMEDABAD          Onion    6.0
4  25-11-97        BHOPAL          Onion    8.0
5  25-11-97        MUMBAI          Onion    7.0
6  25-11-97        JAIPUR          Onion    6.0
7  25-11-97         PATNA          Onion    NaN
8  25-11-97  BHUBANESHWAR          Onion    9.0
9  25-11-97       KOLKATA          Onion   11.0

In [10]:
data.tail()

            Date      Centre_Name Commodity_Name  Price
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

In [11]:
data.tail(10)

            Date      Centre_Name Commodity_Name  Price
127901  28-04-15         THRISSUR          Onion   30.0
127902  28-04-15         PALAKKAD          Onion   24.0
127903  28-04-15          WAYANAD          Onion   41.0
127904  28-04-15       PUDUCHERRY          Onion   18.0
127905  28-04-15          CHENNAI          Onion   19.0
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

In [12]:
data['Price'].sort_values()

16130     2.0
16094     2.0
16112     2.0
12008     2.0
37260     2.0
         ...
127813    NaN
127815    NaN
127866    NaN
127867    NaN
127886    NaN
Name: Price, Length: 127911, dtype: float64

In [13]:
data.sort_values('Price')

            Date Centre_Name Commodity_Name  Price
16130   19-07-01      BHOPAL          Onion    2.0
16094   17-07-01      BHOPAL          Onion    2.0
16112   18-07-01      BHOPAL          Onion    2.0
12008   11-08-00      BHOPAL          Onion    2.0
37260   28-04-06      BHOPAL          Onion    2.0
...          ...         ...            ...    ...
127813  27-04-15    SILIGURI          Onion    NaN
127815  27-04-15    ITANAGAR          Onion    NaN
127866  28-04-15     GWALIOR          Onion    NaN
127867  28-04-15    JABALPUR          Onion    NaN
127886  28-04-15    ITANAGAR          Onion    NaN

[127911 rows x 4 columns]

In [14]:
data.sort_values('Centre_Name')

            Date Centre_Name Commodity_Name  Price
36711   10-03-06    AGARTALA          Onion    8.0
73531   06-05-11    AGARTALA          Onion   14.0
38758   23-08-06    AGARTALA          Onion   10.0
5772    22-03-99    AGARTALA          Onion   10.0
26127   21-10-03    AGARTALA          Onion   18.0
...          ...         ...            ...    ...
124296  09-02-15     WAYANAD          Onion   45.0
126909  07-04-15     WAYANAD          Onion   41.0
127548  21-04-15     WAYANAD          Onion   41.0
123624  22-01-15     WAYANAD          Onion   41.0
124160  05-02-15     WAYANAD          Onion   45.0

[127911 rows x 4 columns]

In [15]:
data.sort_values('Price').head()

           Date Centre_Name Commodity_Name  Price
16130  19-07-01      BHOPAL          Onion    2.0
16094  17-07-01      BHOPAL          Onion    2.0
16112  18-07-01      BHOPAL          Onion    2.0
12008  11-08-00      BHOPAL          Onion    2.0
37260  28-04-06      BHOPAL          Onion    2.0

In [16]:
data.sort_values('Price',ascending=False)

            Date Centre_Name Commodity_Name  Price
106332  13-11-13      AIZWAL          Onion  100.0
107016  02-12-13      AIZWAL          Onion  100.0
105933  04-11-13      AIZWAL          Onion  100.0
106161  08-11-13      AIZWAL          Onion  100.0
106047  06-11-13      AIZWAL          Onion  100.0
...          ...         ...            ...    ...
127813  27-04-15    SILIGURI          Onion    NaN
127815  27-04-15    ITANAGAR          Onion    NaN
127866  28-04-15     GWALIOR          Onion    NaN
127867  28-04-15    JABALPUR          Onion    NaN
127886  28-04-15    ITANAGAR          Onion    NaN

[127911 rows x 4 columns]

In [17]:
data.sort_values('Price',ascending=False)

            Date Centre_Name Commodity_Name  Price
106332  13-11-13      AIZWAL          Onion  100.0
107016  02-12-13      AIZWAL          Onion  100.0
105933  04-11-13      AIZWAL          Onion  100.0
106161  08-11-13      AIZWAL          Onion  100.0
106047  06-11-13      AIZWAL          Onion  100.0
...          ...         ...            ...    ...
127813  27-04-15    SILIGURI          Onion    NaN
127815  27-04-15    ITANAGAR          Onion    NaN
127866  28-04-15     GWALIOR          Onion    NaN
127867  28-04-15    JABALPUR          Onion    NaN
127886  28-04-15    ITANAGAR          Onion    NaN

[127911 rows x 4 columns]

this is a header

In [18]:
data.shape

# THIS IS A HEADER

(127911, 4)

In [19]:
data.head

<bound method NDFrame.head of             Date      Centre_Name Commodity_Name  Price
0       25-11-97            DELHI          Onion    8.0
1       25-11-97           SHIMLA          Onion    7.0
2       25-11-97          LUCKNOW          Onion    5.0
3       25-11-97        AHMEDABAD          Onion    6.0
4       25-11-97           BHOPAL          Onion    8.0
...          ...              ...            ...    ...
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]>

In [20]:
data.head()

       Date Centre_Name Commodity_Name  Price
0  25-11-97       DELHI          Onion    8.0
1  25-11-97      SHIMLA          Onion    7.0
2  25-11-97     LUCKNOW          Onion    5.0
3  25-11-97   AHMEDABAD          Onion    6.0
4  25-11-97      BHOPAL          Onion    8.0

In [21]:
data.tail()

            Date      Centre_Name Commodity_Name  Price
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

In [22]:
data.tail(10)

            Date      Centre_Name Commodity_Name  Price
127901  28-04-15         THRISSUR          Onion   30.0
127902  28-04-15         PALAKKAD          Onion   24.0
127903  28-04-15          WAYANAD          Onion   41.0
127904  28-04-15       PUDUCHERRY          Onion   18.0
127905  28-04-15          CHENNAI          Onion   19.0
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

In [24]:
data['Date']

0         25-11-97
1         25-11-97
2         25-11-97
3         25-11-97
4         25-11-97
            ...
127906    28-04-15
127907    28-04-15
127908    28-04-15
127909    28-04-15
127910    28-04-15
Name: Date, Length: 127911, dtype: object

In [25]:
data['Centre_Name']

0                   DELHI
1                  SHIMLA
2                 LUCKNOW
3               AHMEDABAD
4                  BHOPAL
               ...
127906           DINDIGUL
127907    THIRUCHIRAPALLI
127908         COIMBATORE
127909        TIRUNELVELI
127910          HYDERABAD
Name: Centre_Name, Length: 127911, dtype: object

In [26]:
data['Centre_Name'].nunique()

72

In [31]:
len(data.groupby('Centre_Name'))

72

In [30]:
list(data.groupby('Centre_Name'))

[('AGARTALA',             Date Centre_Name Commodity_Name  Price
  13      25-11-97    AGARTALA          Onion    9.0
  31      26-11-97    AGARTALA          Onion    9.0
  49      27-11-97    AGARTALA          Onion    9.0
  67      28-11-97    AGARTALA          Onion   13.0
  85      01-12-97    AGARTALA          Onion   13.0
  ...          ...         ...            ...    ...
  127607  22-04-15    AGARTALA          Onion   27.0
  127678  23-04-15    AGARTALA          Onion   27.0
  127749  24-04-15    AGARTALA          Onion   27.0
  127820  27-04-15    AGARTALA          Onion   27.0
  127891  28-04-15    AGARTALA          Onion   27.0

  [4292 rows x 4 columns]),
 ('AGRA',             Date Centre_Name Commodity_Name  Price
  65350   31-08-10        AGRA          Onion    NaN
  65399   01-09-10        AGRA          Onion    NaN
  65448   03-09-10        AGRA          Onion   12.0
  65497   06-09-10        AGRA          Onion   12.0
  65546   07-09-10        AGRA          Onion   12.0
  ...          ...         ...            ...    ...
  127573  22-04-15        AGRA          Onion   25.0
  127644  23-04-15        AGRA          Onion   25.0
  127715  24-04-15        AGRA          Onion   25.0
  127786  27-04-15        AGRA          Onion   25.0
  127857  28-04-15        AGRA          Onion   25.0

  [1142 rows x 4 columns]),
 ('AHMEDABAD',             Date Centre_Name Commodity_Name  Price
  3       25-11-97   AHMEDABAD          Onion    6.0
  21      26-11-97   AHMEDABAD          Onion    6.0
  39      27-11-97   AHMEDABAD          Onion    6.0
  57      28-11-97   AHMEDABAD          Onion    6.0
  75      01-12-97   AHMEDABAD          Onion    6.0
  ...          ...         ...            ...    ...
  127578  22-04-15   AHMEDABAD          Onion   18.0
  127649  23-04-15   AHMEDABAD          Onion   18.0
  127720  24-04-15   AHMEDABAD          Onion   18.0
  127791  27-04-15   AHMEDABAD          Onion   18.0
  127862  28-04-15   AHMEDABAD          Onion   18.0

  [4292 rows x 4 columns]),
 ('AIZWAL',             Date Centre_Name Commodity_Name  Price
  12      25-11-97      AIZWAL          Onion    9.0
  30      26-11-97      AIZWAL          Onion    9.0
  48      27-11-97      AIZWAL          Onion    9.0
  66      28-11-97      AIZWAL          Onion    9.0
  84      01-12-97      AIZWAL          Onion    9.0
  ...          ...         ...            ...    ...
  127605  22-04-15      AIZWAL          Onion   38.0
  127676  23-04-15      AIZWAL          Onion   38.0
  127747  24-04-15      AIZWAL          Onion    NaN
  127818  27-04-15      AIZWAL          Onion   38.0
  127889  28-04-15      AIZWAL          Onion   38.0

  [4291 rows x 4 columns]),
 ('AMRITSAR',             Date Centre_Name Commodity_Name  Price
  38647   17-08-06    AMRITSAR          Onion   11.0
  38691   21-08-06    AMRITSAR          Onion   13.0
  38717   22-08-06    AMRITSAR          Onion   11.0
  38742   23-08-06    AMRITSAR          Onion   13.0
  38767   24-08-06    AMRITSAR          Onion   20.0
  ...          ...         ...            ...    ...
  127567  22-04-15    AMRITSAR          Onion   20.0
  127638  23-04-15    AMRITSAR          Onion   20.0
  127709  24-04-15    AMRITSAR          Onion   20.0
  127780  27-04-15    AMRITSAR          Onion   20.0
  127851  28-04-15    AMRITSAR          Onion   20.0

  [2093 rows x 4 columns]),
 ('BATHINDA',             Date Centre_Name Commodity_Name  Price
  65346   31-08-10    BATHINDA          Onion    NaN
  65395   01-09-10    BATHINDA          Onion   14.0
  65444   03-09-10    BATHINDA          Onion   12.0
  65493   06-09-10    BATHINDA          Onion   12.0
  65542   07-09-10    BATHINDA          Onion   12.0
  ...          ...         ...            ...    ...
  127569  22-04-15    BATHINDA          Onion   20.0
  127640  23-04-15    BATHINDA          Onion   20.0
  127711  24-04-15    BATHINDA          Onion   20.0
  127782  27-04-15    BATHINDA          Onion   20.0
  127853  28-04-15    BATHINDA          Onion   20.0

  [1142 rows x 4 columns]),
 ('BENGALURU',             Date Centre_Name Commodity_Name  Price
  14      25-11-97   BENGALURU          Onion    6.0
  32      26-11-97   BENGALURU          Onion    6.0
  50      27-11-97   BENGALURU          Onion    6.0
  68      28-11-97   BENGALURU          Onion    6.0
  86      01-12-97   BENGALURU          Onion    6.0
  ...          ...         ...            ...    ...
  127610  22-04-15   BENGALURU          Onion   20.0
  127681  23-04-15   BENGALURU          Onion   20.0
  127752  24-04-15   BENGALURU          Onion    NaN
  127823  27-04-15   BENGALURU          Onion   20.0
  127894  28-04-15   BENGALURU          Onion   22.0

  [4292 rows x 4 columns]),
 ('BHAGALPUR',             Date Centre_Name Commodity_Name  Price
  65363   31-08-10   BHAGALPUR          Onion    NaN
  65412   01-09-10   BHAGALPUR          Onion    NaN
  65461   03-09-10   BHAGALPUR          Onion   16.0
  65510   06-09-10   BHAGALPUR          Onion   16.0
  65559   07-09-10   BHAGALPUR          Onion   16.0
  ...          ...         ...            ...    ...
  127592  22-04-15   BHAGALPUR          Onion   18.0
  127663  23-04-15   BHAGALPUR          Onion    NaN
  127734  24-04-15   BHAGALPUR          Onion   18.0
  127805  27-04-15   BHAGALPUR          Onion    NaN
  127876  28-04-15   BHAGALPUR          Onion   18.0

  [1142 rows x 4 columns]),
 ('BHOPAL',             Date Centre_Name Commodity_Name  Price
  4       25-11-97      BHOPAL          Onion    8.0
  22      26-11-97      BHOPAL          Onion    5.0
  40      27-11-97      BHOPAL          Onion    5.0
  58      28-11-97      BHOPAL          Onion    5.0
  76      01-12-97      BHOPAL          Onion    5.0
  ...          ...         ...            ...    ...
  127580  22-04-15      BHOPAL          Onion   10.0
  127651  23-04-15      BHOPAL          Onion   10.0
  127722  24-04-15      BHOPAL          Onion   10.0
  127793  27-04-15      BHOPAL          Onion   10.0
  127864  28-04-15      BHOPAL          Onion   10.0

  [4291 rows x 4 columns]),
 ('BHUBANESHWAR',             Date   Centre_Name Commodity_Name  Price
  8       25-11-97  BHUBANESHWAR          Onion    9.0
  26      26-11-97  BHUBANESHWAR          Onion    9.0
  44      27-11-97  BHUBANESHWAR          Onion    9.0
  62      28-11-97  BHUBANESHWAR          Onion    9.0
  80      01-12-97  BHUBANESHWAR          Onion    9.0
  ...          ...           ...            ...    ...
  127595  22-04-15  BHUBANESHWAR          Onion   20.0
  127666  23-04-15  BHUBANESHWAR          Onion   20.0
  127737  24-04-15  BHUBANESHWAR          Onion   20.0
  127808  27-04-15  BHUBANESHWAR          Onion   20.0
  127879  28-04-15  BHUBANESHWAR          Onion   20.0

  [4292 rows x 4 columns]),
 ('CHANDIGARH',             Date Centre_Name Commodity_Name  Price
  38642   17-08-06  CHANDIGARH          Onion   11.0
  38686   21-08-06  CHANDIGARH          Onion   11.0
  38712   22-08-06  CHANDIGARH          Onion   11.0
  38737   23-08-06  CHANDIGARH          Onion   11.0
  38878   01-09-06  CHANDIGARH          Onion   10.0
  ...          ...         ...            ...    ...
  127556  22-04-15  CHANDIGARH          Onion   23.0
  127627  23-04-15  CHANDIGARH          Onion   22.0
  127698  24-04-15  CHANDIGARH          Onion   22.0
  127769  27-04-15  CHANDIGARH          Onion   22.0
  127840  28-04-15  CHANDIGARH          Onion   22.0

  [2105 rows x 4 columns]),
 ('CHENNAI',             Date Centre_Name Commodity_Name  Price
  16      25-11-97     CHENNAI          Onion    5.0
  34      26-11-97     CHENNAI          Onion    NaN
  52      27-11-97     CHENNAI          Onion    7.0
  70      28-11-97     CHENNAI          Onion    7.0
  88      01-12-97     CHENNAI          Onion    7.0
  ...          ...         ...            ...    ...
  127621  22-04-15     CHENNAI          Onion   19.0
  127692  23-04-15     CHENNAI          Onion   20.0
  127763  24-04-15     CHENNAI          Onion   20.0
  127834  27-04-15     CHENNAI          Onion   20.0
  127905  28-04-15     CHENNAI          Onion   19.0

  [4292 rows x 4 columns]),
 ('COIMBATORE',             Date Centre_Name Commodity_Name  Price
  117077  19-08-14  COIMBATORE          Onion    NaN
  117140  20-08-14  COIMBATORE          Onion    NaN
  117203  21-08-14  COIMBATORE          Onion   25.0
  117266  22-08-14  COIMBATORE          Onion   25.0
  117329  25-08-14  COIMBATORE          Onion   25.0
  ...          ...         ...            ...    ...
  127624  22-04-15  COIMBATORE          Onion   18.0
  127695  23-04-15  COIMBATORE          Onion   18.0
  127766  24-04-15  COIMBATORE          Onion   18.0
  127837  27-04-15  COIMBATORE          Onion   18.0
  127908  28-04-15  COIMBATORE          Onion   18.0

  [166 rows x 4 columns]),
 ('CUTTACK',             Date Centre_Name Commodity_Name  Price
  65366   31-08-10     CUTTACK          Onion    NaN
  65415   01-09-10     CUTTACK          Onion    NaN
  65464   03-09-10     CUTTACK          Onion   14.0
  65513   06-09-10     CUTTACK          Onion   14.0
  65562   07-09-10     CUTTACK          Onion   14.0
  ...          ...         ...            ...    ...
  127596  22-04-15     CUTTACK          Onion   22.0
  127667  23-04-15     CUTTACK          Onion   20.0
  127738  24-04-15     CUTTACK          Onion   20.0
  127809  27-04-15     CUTTACK          Onion   20.0
  127880  28-04-15     CUTTACK          Onion   20.0

  [1142 rows x 4 columns]),
 ('DEHRADUN',             Date Centre_Name Commodity_Name  Price
  38650   17-08-06    DEHRADUN          Onion   16.0
  38694   21-08-06    DEHRADUN          Onion   18.0
  38719   22-08-06    DEHRADUN          Onion   18.0
  38745   23-08-06    DEHRADUN          Onion   18.0
  38770   24-08-06    DEHRADUN          Onion   18.0
  ...          ...         ...            ...    ...
  127574  22-04-15    DEHRADUN          Onion   30.0
  127645  23-04-15    DEHRADUN          Onion   30.0
  127716  24-04-15    DEHRADUN          Onion   30.0
  127787  27-04-15    DEHRADUN          Onion   30.0
  127858  28-04-15    DEHRADUN          Onion   30.0

  [2094 rows x 4 columns]),
 ('DELHI',             Date Centre_Name Commodity_Name  Price
  0       25-11-97       DELHI          Onion    8.0
  18      26-11-97       DELHI          Onion    8.0
  36      27-11-97       DELHI          Onion    8.0
  54      28-11-97       DELHI          Onion    9.0
  72      01-12-97       DELHI          Onion   10.0
  ...          ...         ...            ...    ...
  127557  22-04-15       DELHI          Onion   28.0
  127628  23-04-15       DELHI          Onion   28.0
  127699  24-04-15       DELHI          Onion   28.0
  127770  27-04-15       DELHI          Onion   27.0
  127841  28-04-15       DELHI          Onion   27.0

  [4292 rows x 4 columns]),
 ('DHARAMSHALA',             Date  Centre_Name Commodity_Name  Price
  126012  18-03-15  DHARAMSHALA          Onion    NaN
  126081  19-03-15  DHARAMSHALA          Onion    NaN
  126150  20-03-15  DHARAMSHALA          Onion   24.0
  126219  23-03-15  DHARAMSHALA          Onion   24.0
  126288  24-03-15  DHARAMSHALA          Onion   24.0
  126357  25-03-15  DHARAMSHALA          Onion   24.0
  126428  26-03-15  DHARAMSHALA          Onion    NaN
  126499  27-03-15  DHARAMSHALA          Onion   22.0
  126570  30-03-15  DHARAMSHALA          Onion   22.0
  126641  31-03-15  DHARAMSHALA          Onion   22.0
  126712  01-04-15  DHARAMSHALA          Onion   22.0
  126783  06-04-15  DHARAMSHALA          Onion   22.0
  126854  07-04-15  DHARAMSHALA          Onion   20.0
  126925  08-04-15  DHARAMSHALA          Onion   20.0
  126996  09-04-15  DHARAMSHALA          Onion   20.0
  127067  10-04-15  DHARAMSHALA          Onion   20.0
  127138  13-04-15  DHARAMSHALA          Onion   20.0
  127209  15-04-15  DHARAMSHALA          Onion    NaN
  127280  16-04-15  DHARAMSHALA          Onion   20.0
  127351  17-04-15  DHARAMSHALA          Onion   20.0
  127422  20-04-15  DHARAMSHALA          Onion    NaN
  127493  21-04-15  DHARAMSHALA          Onion   20.0
  127564  22-04-15  DHARAMSHALA          Onion   20.0
  127635  23-04-15  DHARAMSHALA          Onion   20.0
  127706  24-04-15  DHARAMSHALA          Onion   20.0
  127777  27-04-15  DHARAMSHALA          Onion   20.0
  127848  28-04-15  DHARAMSHALA          Onion   20.0),
 ('DHARWAD',             Date Centre_Name Commodity_Name  Price
  65379   31-08-10     DHARWAD          Onion    NaN
  65428   01-09-10     DHARWAD          Onion    8.0
  65477   03-09-10     DHARWAD          Onion   10.0
  65526   06-09-10     DHARWAD          Onion   10.0
  65575   07-09-10     DHARWAD          Onion   10.0
  ...          ...         ...            ...    ...
  127611  22-04-15     DHARWAD          Onion   22.0
  127682  23-04-15     DHARWAD          Onion   22.0
  127753  24-04-15     DHARWAD          Onion   22.0
  127824  27-04-15     DHARWAD          Onion   22.0
  127895  28-04-15     DHARWAD          Onion   23.0

  [1142 rows x 4 columns]),
 ('DIMAPUR',             Date Centre_Name Commodity_Name  Price
  65375   31-08-10     DIMAPUR          Onion    NaN
  65424   01-09-10     DIMAPUR          Onion    NaN
  65473   03-09-10     DIMAPUR          Onion   19.0
  65522   06-09-10     DIMAPUR          Onion   19.0
  65571   07-09-10     DIMAPUR          Onion   19.0
  ...          ...         ...            ...    ...
  127606  22-04-15     DIMAPUR          Onion   30.0
  127677  23-04-15     DIMAPUR          Onion   30.0
  127748  24-04-15     DIMAPUR          Onion   30.0
  127819  27-04-15     DIMAPUR          Onion   30.0
  127890  28-04-15     DIMAPUR          Onion   30.0

  [1142 rows x 4 columns]),
 ('DINDIGUL',             Date Centre_Name Commodity_Name  Price
  62358   15-04-10    DINDIGUL          Onion   14.0
  62389   16-04-10    DINDIGUL          Onion   10.0
  62420   19-04-10    DINDIGUL          Onion   12.0
  62451   20-04-10    DINDIGUL          Onion   12.0
  62482   21-04-10    DINDIGUL          Onion   14.0
  ...          ...         ...            ...    ...
  127622  22-04-15    DINDIGUL          Onion   18.0
  127693  23-04-15    DINDIGUL          Onion   18.0
  127764  24-04-15    DINDIGUL          Onion   18.0
  127835  27-04-15    DINDIGUL          Onion   18.0
  127906  28-04-15    DINDIGUL          Onion   18.0

  [1239 rows x 4 columns]),
 ('ERNAKULAM',             Date Centre_Name Commodity_Name  Price
  68909   15-12-10   ERNAKULAM          Onion    NaN
  68959   16-12-10   ERNAKULAM          Onion    NaN
  69009   20-12-10   ERNAKULAM          Onion    NaN
  69059   21-12-10   ERNAKULAM          Onion    NaN
  69109   22-12-10   ERNAKULAM          Onion    NaN
  ...          ...         ...            ...    ...
  127615  22-04-15   ERNAKULAM          Onion   30.0
  127686  23-04-15   ERNAKULAM          Onion   30.0
  127757  24-04-15   ERNAKULAM          Onion   30.0
  127828  27-04-15   ERNAKULAM          Onion   30.0
  127899  28-04-15   ERNAKULAM          Onion   30.0

  [1070 rows x 4 columns]),
 ('GURGAON',             Date Centre_Name Commodity_Name  Price
  111425  27-03-14     GURGAON          Onion    NaN
  111712  03-04-14     GURGAON          Onion    NaN
  111771  04-04-14     GURGAON          Onion   30.0
  111830  07-04-14     GURGAON          Onion   30.0
  111889  09-04-14     GURGAON          Onion   30.0
  ...          ...         ...            ...    ...
  127561  22-04-15     GURGAON          Onion   20.0
  127632  23-04-15     GURGAON          Onion    NaN
  127703  24-04-15     GURGAON          Onion   20.0
  127774  27-04-15     GURGAON          Onion   20.0
  127845  28-04-15     GURGAON          Onion   20.0

  [257 rows x 4 columns]),
 ('GUWAHATI',             Date Centre_Name Commodity_Name  Price
  10      25-11-97    GUWAHATI          Onion    8.0
  28      26-11-97    GUWAHATI          Onion    8.0
  46      27-11-97    GUWAHATI          Onion    NaN
  64      28-11-97    GUWAHATI          Onion    NaN
  82      01-12-97    GUWAHATI          Onion    NaN
  ...          ...         ...            ...    ...
  127603  22-04-15    GUWAHATI          Onion   24.0
  127674  23-04-15    GUWAHATI          Onion   24.0
  127745  24-04-15    GUWAHATI          Onion   24.0
  127816  27-04-15    GUWAHATI          Onion   20.0
  127887  28-04-15    GUWAHATI          Onion   20.0

  [4292 rows x 4 columns]),
 ('GWALIOR',             Date Centre_Name Commodity_Name  Price
  91949   01-11-12     GWALIOR          Onion   12.0
  92004   02-11-12     GWALIOR          Onion   12.0
  92059   05-11-12     GWALIOR          Onion   15.0
  92114   06-11-12     GWALIOR          Onion   15.0
  92169   07-11-12     GWALIOR          Onion   20.0
  ...          ...         ...            ...    ...
  127582  22-04-15     GWALIOR          Onion   15.0
  127653  23-04-15     GWALIOR          Onion   15.0
  127724  24-04-15     GWALIOR          Onion    NaN
  127795  27-04-15     GWALIOR          Onion   15.0
  127866  28-04-15     GWALIOR          Onion    NaN

  [606 rows x 4 columns]),
 ('HALDWANI',             Date Centre_Name Commodity_Name  Price
  124186  06-02-15    HALDWANI          Onion    NaN
  124254  09-02-15    HALDWANI          Onion    NaN
  124322  10-02-15    HALDWANI          Onion   30.0
  124390  11-02-15    HALDWANI          Onion   30.0
  124458  12-02-15    HALDWANI          Onion   30.0
  124526  13-02-15    HALDWANI          Onion   30.0
  124594  16-02-15    HALDWANI          Onion    NaN
  124662  17-02-15    HALDWANI          Onion    NaN
  124730  18-02-15    HALDWANI          Onion    NaN
  124798  19-02-15    HALDWANI          Onion   30.0
  124866  20-02-15    HALDWANI          Onion   30.0
  124934  23-02-15    HALDWANI          Onion   30.0
  125002  24-02-15    HALDWANI          Onion   30.0
  125070  25-02-15    HALDWANI          Onion   30.0
  125138  26-02-15    HALDWANI          Onion   30.0
  125206  27-02-15    HALDWANI          Onion   30.0
  125274  02-03-15    HALDWANI          Onion   30.0
  125342  03-03-15    HALDWANI          Onion   30.0
  125410  04-03-15    HALDWANI          Onion   30.0
  125478  05-03-15    HALDWANI          Onion    NaN
  125546  09-03-15    HALDWANI          Onion   30.0
  125614  10-03-15    HALDWANI          Onion   30.0
  125682  11-03-15    HALDWANI          Onion   30.0
  125750  12-03-15    HALDWANI          Onion   30.0
  125818  13-03-15    HALDWANI          Onion   30.0
  125886  16-03-15    HALDWANI          Onion   30.0
  125954  17-03-15    HALDWANI          Onion   30.0
  126023  18-03-15    HALDWANI          Onion   30.0
  126092  19-03-15    HALDWANI          Onion   30.0
  126161  20-03-15    HALDWANI          Onion   30.0
  126230  23-03-15    HALDWANI          Onion   30.0
  126299  24-03-15    HALDWANI          Onion   30.0
  126368  25-03-15    HALDWANI          Onion   30.0
  126439  26-03-15    HALDWANI          Onion   30.0
  126510  27-03-15    HALDWANI          Onion   30.0
  126581  30-03-15    HALDWANI          Onion   30.0
  126652  31-03-15    HALDWANI          Onion   30.0
  126723  01-04-15    HALDWANI          Onion   30.0
  126794  06-04-15    HALDWANI          Onion   30.0
  126865  07-04-15    HALDWANI          Onion   30.0
  126936  08-04-15    HALDWANI          Onion   30.0
  127007  09-04-15    HALDWANI          Onion   30.0
  127078  10-04-15    HALDWANI          Onion   30.0
  127149  13-04-15    HALDWANI          Onion   30.0
  127220  15-04-15    HALDWANI          Onion   30.0
  127291  16-04-15    HALDWANI          Onion   30.0
  127362  17-04-15    HALDWANI          Onion   30.0
  127433  20-04-15    HALDWANI          Onion   30.0
  127504  21-04-15    HALDWANI          Onion   30.0
  127575  22-04-15    HALDWANI          Onion   30.0
  127646  23-04-15    HALDWANI          Onion   30.0
  127717  24-04-15    HALDWANI          Onion   30.0
  127788  27-04-15    HALDWANI          Onion   30.0

In [32]:
len(data.groupby('Price'))

158

In [27]:
data['Centre_Name'].unique()

array(['DELHI', 'SHIMLA', 'LUCKNOW', 'AHMEDABAD', 'BHOPAL', 'MUMBAI',
       'JAIPUR', 'PATNA', 'BHUBANESHWAR', 'KOLKATA', 'GUWAHATI',
       'SHILLONG', 'AIZWAL', 'AGARTALA', 'BENGALURU', 'T.PURAM',
       'CHENNAI', 'HYDERABAD', 'CHANDIGARH', 'SRINAGAR', 'JAMMU',
       'AMRITSAR', 'LUDHIANA', 'DEHRADUN', 'RAIPUR', 'RANCHI', 'KOHIMA',
       'KANPUR', 'RAJKOT', 'VIJAYWADA', 'DINDIGUL', 'HISAR', 'KARNAL',
       'MANDI', 'BATHINDA', 'VARANASI', 'AGRA', 'INDORE', 'NAGPUR',
       'JODHPUR', 'KOTA', 'BHAGALPUR', 'CUTTACK', 'SAMBALPUR', 'SILIGURI',
       'ITANAGAR', 'DIMAPUR', 'DHARWAD', 'THIRUCHIRAPALLI', 'ERNAKULAM',
       'PORT BLAIR', 'PUDUCHERRY', 'PANAJI', 'GWALIOR', 'JABALPUR',
       'KOZHIKODE', 'ROURKELA', 'VISAKHAPATNAM', 'PANCHKULA', 'GURGAON',
       'REWA', 'SAGAR', 'COIMBATORE', 'TIRUNELVELI', 'PURNIA', 'THRISSUR',
       'PALAKKAD', 'WAYANAD', 'HALDWANI', 'DHARAMSHALA', 'MANGALORE',
       'MYSORE'], dtype=object)

In [33]:
data['Centre_Name'].value_counts()

PATNA          4292
KOLKATA        4292
MUMBAI         4292
CHENNAI        4292
JAIPUR         4292
               ...
THRISSUR         68
HALDWANI         54
DHARAMSHALA      27
MYSORE           22
MANGALORE        22
Name: Centre_Name, Length: 72, dtype: int64

In [34]:
data['Commodity_Name'].value_counts()

Onion    127911
Name: Commodity_Name, dtype: int64

In [35]:
data['Price'].value_counts()

10.00    11278
12.00     8210
8.00      7537
20.00     7454
15.00     6278
         ...
20.50        1
8.55         1
3.80         1
18.40        1
6.60         1
Name: Price, Length: 158, dtype: int64

In [ ]:
data.drop(['Date', 'Commodity_Name'],axis=1)

In [ ]:
data.drop(columns=['Date', 'Commodity_Name'])

In [ ]:
data

In [ ]:
data['Date'] #print(data['Date', 'Commodity_Name'])

In [ ]:
data[['Date', 'Price']]

In [ ]:
data.iloc[:, 0:2]

In [ ]:
data.sort_values('Price')

In [ ]:
list(data['Price'].sort_values())

In [ ]:
data['Price'].sort_values()

In [ ]:
data[data.columns[1:3]]

In [ ]:
data.drop(columns=['Date', 'Commodity_Name'])

In [ ]:
data.rename(columns={"Date": "Date_of_Sale"})

In [ ]:
len(df.isnull())